app/Models/FeederModel.php

    public function getAllLog()
    {
        return $this->select('log_id, tanggal_waktu, tingkat_kekeruhan, status.status')
                    ->join('status', 'log.status_id = status.status_id')
                    ->asObject()
                    ->findAll();
---
SELECT `log_id`, `tanggal_waktu`, `tingkat_kekeruhan`, `status`.`status`
FROM `log`
JOIN `status` ON `log`.`status_id` = `status`.`status_id`

     public function getTop5Records()
    {
        return $this->select('log_id, tanggal_waktu, tingkat_kekeruhan, status.status')
                    ->join('status', 'log.status_id = status.status_id')
                    ->orderBy('tanggal_waktu', 'DESC')
                    ->limit(5)
                    ->findAll();
---
SELECT `log_id`, `tanggal_waktu`, `tingkat_kekeruhan`, `status`.`status`
FROM `log`
JOIN `status` ON `log`.`status_id` = `status`.`status_id`
ORDER BY `tanggal_waktu` DESC
 LIMIT 5